## Angular Module

### 모듈

Angular의 모듈은 Angular의 컴포넌트, 디렉티브, 파이프, 서비스 등과 같이 관련이 있는 요소를 모은 하나의 단위를 의미한다. 모듈은 다른 모듈과 결합할 수 있으며 Angular는 여러 모듈을 조합하여 하나의 애플리케이션을 구성한다. 또한 모듈은 다른 모듈을 import 할 수 있다. Angular에서 제공하는 라이브러리 모듈이나 서드 파티 라이브러리도 import 하여 사용할 수 있다. 이러한 모듈성은 애플리케이션 개발에 있어서 중요한 의미를 갖는다. 애플리케이션에 대한 요구사항이 많아지면서 코드의 복잡도가 높아짐에 따라 루트 모듈, 기능 모듈, 공유 모듈, 핵심 모듈 등으로 모듈을 분리하여 구성한다. 이러한 특징은 모듈 간의 결합을 최소화하고 서로 연관 있는 모듈간의 응집성을 극대화해준다.

#### 루트 모듈

  
루트 모듈은 Angular 애플리케이션 최상위에 존재하는 모듈이다. 컴포넌트, 디렉티브, 파이프, 서비스를 선언하거나 의존 라이브러리 모듈과 기능 모듈을 import 할 수 있다. 모든 애플리케이션은 루트 모듈을 가지고 있어야 하며 애플리케이션의 최상위에 위치하고 시작점의 역할을 한다. 즉, 루트 모듈이 부트스트랩되면서 애플리케이션이 동작하게 된다.  
루트 모듈은 일반적으로 AppModule 이라는 이름으로 생성되며 Angular CLI를 이용하여 프로젝트 생성시 app.module.ts라는 파일로 생성된다.

####   
@NgModule 데코레이터

  
Angular 애플리케이션의 모듈은 @NgModule 데코레이터가 적용된 클래스다. @NgModule 데코레이터는 함수이며 모듈의 설정 정보가 담긴 메타데이터 객체를 파라미터로 받아서 모듈을 생성한다. 메타데이터는 declarations, imports, providers, bootstrap 등의 프로퍼티로 구성된다.  
  

###   
라이브러리 모듈

  
라이브러리 모듈은 Angular에서 제공하는 built-in 모듈이다. 라이브러리 모듈 패키지는 모듈의 집합체이며 필요한 모듈만 선택하여 import할 수 있다.  
Angular CLI를 이용하여 생성한 프로젝트의 package.json 파일을 보면 @angular 라이브러리 모듈이 포함되어 있는 것을 확인할 수 있다.

-   @angular/common: 파이프, 디렉티브 관련 모듈
-   @angular/core: 주요 데코레이터 및 핵심 모듈
-   @angular/forms: 폼 관련 디렉티브 및 모듈
-   @angular/http: HTTP 통신과 관련된 모듈
-   @angular/platform-browser: 브라우저 모듈
-   @angular/router: 라우터 관련 디렉티브 및 모듈
-   @angular/testing: 테스팅 관련 모듈

### 모듈의 분리

애플리케이션의 복잡도가 증가하고 커짐에 따라 루트 모듈에 등록된 컴포넌트, 디렉티브, 파이프, 서비스도 함께 늘어난다. 이렇게 루트 모듈에 여러 기능이 혼재되면 관리와 분업이 어려워지기 때문에 모듈을 분리한다.

\- 기능 모듈

관심사가 유사한 구성요소로 구성

특정 화면 단위로 적용

\- 공유 모듈

애플리케이션 전역에 공유한 구성요소로 구성. 기능 모듈에 의해 import 됨

애플리케이션 전역에서 사용되는 컴포넌트, 디렉티브 등

\- 핵심 모듈

애플리케이션 전역에 공통으로 사용할 구성요소로 구성. 루트 모듈에 등록하여 싱글톤으로 사용

애플리케이션 전역에서 사용되는 서비스. Ex) auth.service, auth.guard, data.service

### 참고

[https://freestrokes.tistory.com/97?category=1064730](https://freestrokes.tistory.com/97?category=1064730)
